tutorials/charOnlyMove/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       startTime;

startTime       0; 

stopAt          endTime;

endTime         10;

deltaT          1e-1;

maxDeltaT	    0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo      1; 

maxDi      5000;

functions
{
//    #includeFunc  probes
//    #includeFunc  sample

    // Regression-test scalars (see applications/test/regression/).
    // The include is silent if the file is absent, so removing
    // regressionFunctions reverts the case to its original behaviour.
    #includeIfPresent "regressionFunctions"
}

// ************************************************************************* //
